InformationRegisters/НалогообложениеНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НалогообложениеНачислений</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияИПН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюИПН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОПВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОПВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюСН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияСО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОППВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОППВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияВОСМС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюВОСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияООСМС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюООСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияЕП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюЕП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОПВР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОПВР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДивидендов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыВыплатБывшимСотрудникам</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихДоходовФизическихЛиц</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыНалогообложенияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыНалогообложенияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяЦеликом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяЦеликом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НалогообложениеНачислений/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ = РегистрыСведений.НалогообложениеНачислений.ПустойКлюч() Тогда
		ПолучитьПризнакиУчета(Запись.ВидДохода);		
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоходаПриИзменении(Элемент)

	ПолучитьПризнакиУчета(Запись.ВидДохода);
	
	Запись.СпособОбложенияИПН 	= ?(УчитыватьИПН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияОПВ	= ?(УчитыватьОПВ, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияСН 	= ?(УчитыватьСН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияСО 	= ?(УчитыватьСО, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияОППВ  = ?(УчитыватьОППВ, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияВОСМС = ?(УчитыватьВОСМС, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияООСМС = ?(УчитыватьООСМС, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияЕП 	= ?(УчитыватьЕП, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияОПВР 	= ?(УчитыватьОПВР, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);

	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособОбложенияПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Запись   = Форма.Запись;
	
	НеОблагаетсяЧастично = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично"); 
	
	Элементы.ДоходНеПодлежащийНалогообложениюИПН.Видимость	= Запись.СпособОбложенияИПН  = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюОПВ.Видимость 	= Запись.СпособОбложенияОПВ  = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюСН.Видимость 	= Запись.СпособОбложенияСН 	 = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюСО.Видимость 	= Запись.СпособОбложенияСО 	 = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюОППВ.Видимость = Запись.СпособОбложенияОППВ = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюВОСМС.Видимость = Запись.СпособОбложенияВОСМС 	 = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюООСМС.Видимость = Запись.СпособОбложенияООСМС = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюЕП.Видимость = Запись.СпособОбложенияЕП = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюОПВР.Видимость = Запись.СпособОбложенияОПВР = НеОблагаетсяЧастично;
	
	Элементы.ДекорацияИПН.Видимость	 = НЕ Элементы.ДоходНеПодлежащийНалогообложениюИПН.Видимость; 
	Элементы.ДекорацияОПВ.Видимость  = НЕ Элементы.ДоходНеПодлежащийНалогообложениюОПВ.Видимость; 
	Элементы.ДекорацияСН.Видимость 	 = НЕ Элементы.ДоходНеПодлежащийНалогообложениюСН.Видимость; 
	Элементы.ДекорацияСО.Видимость	 = НЕ Элементы.ДоходНеПодлежащийНалогообложениюСО.Видимость; 
	Элементы.ДекорацияОППВ.Видимость = НЕ Элементы.ДоходНеПодлежащийНалогообложениюОППВ.Видимость;
	Элементы.ДекорацияВОСМС.Видимость = НЕ Элементы.ДоходНеПодлежащийНалогообложениюВОСМС.Видимость; 
	Элементы.ДекорацияООСМС.Видимость = НЕ Элементы.ДоходНеПодлежащийНалогообложениюООСМС.Видимость;
	Элементы.ДекорацияЕП.Видимость 	 = НЕ Элементы.ДоходНеПодлежащийНалогообложениюЕП.Видимость;
	Элементы.ДекорацияОПВР.Видимость 	 = НЕ Элементы.ДоходНеПодлежащийНалогообложениюОПВР.Видимость;
	
	Элементы.СпособОбложенияИПН.Доступность  =  Форма.УчитыватьИПН;
	Элементы.СпособОбложенияОПВ.Доступность  =  Форма.УчитыватьОПВ;
	Элементы.СпособОбложенияСН.Доступность	 =  Форма.УчитыватьСН;
	Элементы.СпособОбложенияСО.Доступность 	 =  Форма.УчитыватьСО;
	Элементы.СпособОбложенияОППВ.Доступность =  Форма.УчитыватьОППВ;
	Элементы.СпособОбложенияВОСМС.Доступность =  Форма.УчитыватьВОСМС;
	Элементы.СпособОбложенияООСМС.Доступность =  Форма.УчитыватьООСМС;
	Элементы.СпособОбложенияЕП.Доступность 	 =  Форма.УчитыватьЕП;
	Элементы.СпособОбложенияОПВР.Доступность =  Форма.УчитыватьОПВР;

КонецПроцедуры

&НаСервере
Процедура ПолучитьПризнакиУчета(ВидДохода)

	УчитыватьИПН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьИПН");
	УчитыватьОПВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьОПВ");
	УчитыватьСН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьСН");
	УчитыватьСО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьСО");
	УчитыватьОППВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьОППВ");
	УчитыватьВОСМС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьВОСМС");
	УчитыватьООСМС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьООСМС");
	УчитыватьЕП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьЕП");
	УчитыватьОПВР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьОПВР");

КонецПроцедуры

#КонецОбласти
